# KeyBasedTreeEntries Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeyBasedTreeEntries Properties
KeyBasedTreeEntries Class See Also
---
The KeyBasedTreeEntries type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace